Revit 2026 API

# ExternallyTaggedGeometryValidation Class

---

Provides validation for geometry to be stored in an ExternallyTaggedGeometry.

SystemObject Autodesk.Revit.DBExternallyTaggedGeometryValidation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternallyTaggedGeometryValidation
```
```vb
Public NotInheritable Class ExternallyTaggedGeometryValidation
```
```cpp
public ref class ExternallyTaggedGeometryValidation abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternallyTaggedGeometryValidation = class end
```

The ExternallyTaggedGeometryValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsNonSolid | Makes sure that the input geometry object is not a Solid. |
|  | IsSolid | Makes sure that the input geometry object is a Solid. |
|  | LacksSubnodes | Makes sure that the input geometry object does not have sub-nodes. |

#### Reference

Autodesk.Revit.DB Namespace